In [43]:
import pandas as pd
pd.set_option('display.max_columns', 100)
import acquire
import prepare
import seaborn as sns
from sklearn.model_selection import train_test_split
import env

## Acquire

#### 4. Acquire iris data

In [2]:
# Create a pandas dataframe, iris, from this data.
iris = sns.load_dataset('iris')

# print the first 3 rows
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [3]:
# print the number of rows and columns (shape)
iris.shape

(150, 5)

In [4]:
# print the column names
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [5]:
# print the data type of each column
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [6]:
# print the summary statistics for each of the numeric variables
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

<div style="border:1px solid black;"></div>

#### 5. Acquire google data

In [7]:
url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = url.replace('/edit#gid=', '/export?format=csv&gid=')

In [8]:
# return data from url
df_google = pd.read_csv(csv_export_url)

#  export?format=csv

# print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
# print the number of rows and columns
df_google.shape

In [ ]:
# print the column names
df_google.columns

In [ ]:
# print the data type of each column
df_google.dtypes

In [9]:
# print the summary statistics for each of the numeric variables
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
# print the unique values for each of your categorical variables
for col in df_google.columns:
    if len(df_google[col].unique()) < 10:
        print(f'{col} unique values: {df_google[col].unique()}')

Survived unique values: [0 1]
Pclass unique values: [3 1 2]
Sex unique values: ['male' 'female']
SibSp unique values: [1 0 3 4 2 5 8]
Parch unique values: [0 1 2 5 3 4 6]
Embarked unique values: ['S' 'C' 'Q' nan]

<div style="border:1px solid black;"></div>

#### 6. Acquire excel data

In [11]:
df = pd.read_excel('data/train.xlsx')

In [12]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = df[:100]

In [13]:
# print the number of rows of your original dataframe
df_excel_sample.shape

(100, 12)

In [14]:
# print the first 5 column names
df_excel_sample.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [15]:
# print the column names that have a data type of object
is_obj_col = df_excel_sample.dtypes == 'object'
df_excel_sample.dtypes[is_obj_col]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [16]:
# or
df_excel_sample.select_dtypes(exclude='number').columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [17]:
# compute the range for each of the numeric variables.
col_stats = df_excel_sample.describe().T
col_stats['range'] = col_stats['max'] - col_stats['min']
col_stats

,count,mean,std,min,25%,50%,75%,max,range
PassengerId,100.0,50.500000,29.011492,1.000,25.75,50.500,75.250000,100.0,99.000
Survived,100.0,0.410000,0.494311,0.000,0.00,0.000,1.000000,1.0,1.000
Pclass,100.0,2.400000,0.816497,1.000,2.00,3.000,3.000000,3.0,2.000
Age,78.0,27.465769,15.278878,0.830,18.25,26.000,34.750000,71.0,70.170
SibSp,100.0,0.730000,1.179411,0.000,0.00,0.000,1.000000,5.0,5.000
Parch,100.0,0.440000,0.967346,0.000,0.00,0.000,0.000000,5.0,5.000
Fare,100.0,29.517625,40.972905,7.225,8.05,15.675,32.134375,263.0,255.775

## Prepare

Use Iris Data

In [18]:
iris = acquire.get_iris_data()

In [19]:
# Drop the species_id and measurement_id columns.
cols_to_drop = ['species_id', 'measurement_id']
iris = iris.drop(columns=cols_to_drop)

In [20]:
# Rename the species_name column to just species.
iris = iris.rename(columns={'species_name':'species'})
iris.columns

Index(['species', 'sepal_length', 'sepal_width', 'petal_length',
       'petal_width'],
      dtype='object')

In [21]:
# Create dummy variables of the species name and concatenate onto the iris dataframe. 
# (This is for practice, we don't always have to encode the target, 
# but if we used species as a feature, we would need to encode it).
dummy_df = pd.get_dummies(iris['species'], drop_first=True)
dummy_df.head(2)

   versicolor  virginica
0           0          0
1           0          0

In [22]:
iris = pd.concat([iris, dummy_df], axis=1)
iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [23]:
# Create a function named prep_iris that accepts the untransformed iris data,
# and returns the data with the transformations above applied.
## Down below, and in prepare.py

Use the Titanic dataset

In [24]:
# Use the function defined in acquire.py to load the Titanic data.
titanic = acquire.get_titanic_data()

In [25]:
# Drop any unnecessary, unhelpful, or duplicated columns.
display(titanic.head(1))
# getting value counts of categorical columns
[display(titanic[col].value_counts(dropna=False)) for col in titanic.columns if len(titanic[col].unique()) < 8]
print('Print titanic info:\n')
titanic.info()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.25,S,Third,NaN,Southampton,0

0    549
1    342
Name: survived, dtype: int64

3    491
1    216
2    184
Name: pclass, dtype: int64

male      577
female    314
Name: sex, dtype: int64

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: parch, dtype: int64

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

Third     491
First     216
Second    184
Name: class, dtype: int64

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

1    537
0    354
Name: alone, dtype: int64

Print titanic info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [26]:
# dropping embarked column
cols_to_drop = ['embarked', 'pclass']
titanic = titanic.drop(columns=cols_to_drop)

In [27]:
# Encode the categorical columns. Create dummy variables of the categorical 
# columns and concatenate them onto the dataframe.

dummy_df = pd.get_dummies(titanic[['embark_town', 'class', 'sex']], dummy_na=False, drop_first=True)
titanic = pd.concat([titanic, dummy_df], axis=1)
titanic.head(1)

,passenger_id,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone,embark_town_Queenstown,embark_town_Southampton,class_Second,class_Third,sex_male
0,0,0,male,22.0,1,0,7.25,Third,NaN,Southampton,0,0,1,0,1,1

Use the Telco dataset

In [28]:
# Use the function defined in acquire.py to load the Telco data.
telco = acquire.get_telco_data()
telco.head(5)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

Note: those who have "No internet service" in a column have it in other columns

In [29]:
# Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping
# foreign key columns but keeping the corresponding string values, for example.
telco = telco.iloc[:,3:]

# getting value counts of categorical columns
[display(telco[col].value_counts()) for col in telco.columns if len(telco[col].unique()) < 8]
print('Print telco info:\n')
telco.info()

Male      3555
Female    3488
Name: gender, dtype: int64

0    5901
1    1142
Name: senior_citizen, dtype: int64

No     3641
Yes    3402
Name: partner, dtype: int64

No     4933
Yes    2110
Name: dependents, dtype: int64

Yes    6361
No      682
Name: phone_service, dtype: int64

No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64

No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64

No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64

No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64

No                     3473
Yes                    2044
No internet service    1526
Name: tech_support, dtype: int64

No                     2810
Yes                    2707
No internet service    1526
Name: streaming_tv, dtype: int64

No                     2785
Yes                    2732
No internet service    1526
Name: streaming_movies, dtype: int64

Yes    4171
No     2872
Name: paperless_billing, dtype: int64

No     5174
Yes    1869
Name: churn, dtype: int64

Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64

Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64

Electronic check             2365
Mailed check                 1612
Bank transfer (automatic)    1544
Credit card (automatic)      1522
Name: payment_type, dtype: int64

Print telco info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            7043 non-null   object
 1   gender                 7043 non-null   object
 2   senior_citizen         7043 non-null   int64
 3   partner                7043 non-null   object
 4   dependents             7043 non-null   object
 5   tenure                 7043 non-null   int64
 6   phone_service          7043 non-null   object
 7   multiple_lines         7043 non-null   object
 8   online_security        7043 non-null   object
 9   online_backup          7043 non-null   object
 10  device_protection      7043 non-null   object
 11  tech_support           7043 non-null   object
 12  streaming_tv           7043 non-null   object
 13  streaming_movies       7043 non-null   object
 14  paperless_billing      7043 non-null   object
 15  monthly_charges        7043 non-null   float64
 16  total_charges          7043 non-null   object
 17  churn                  7043 non-null   object
 18  contract_type          7043 non-null   object
 19  internet_service_type  7043 non-null   object
 20  payment_type           7043 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 1.1+ MB

In [30]:
binary_cols = ['partner','dependents','phone_service', 'paperless_billing', 'churn']
for col in binary_cols:
    telco[col] = telco[col].replace({'Yes': 1, 'No': 0})

dummy_df = pd.get_dummies(telco[['gender', 'multiple_lines', 'online_security', 'online_backup',
                                 'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies',
                                 'contract_type', 'internet_service_type', 'payment_type']],
                          dummy_na=False, drop_first=True)
telco = pd.concat([telco, dummy_df], axis=1)

In [31]:
# rename columns to be lowercased with underscores
telco.columns = [col.lower().replace(" ", "_") for col in telco.columns]

In [32]:
# Create a function named prep_telco that accepts the raw telco data,
# and returns the data with the transformations above applied.
telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type,gender_male,multiple_lines_no_phone_service,multiple_lines_yes,online_security_no_internet_service,online_security_yes,online_backup_no_internet_service,online_backup_yes,device_protection_no_internet_service,device_protection_yes,tech_support_no_internet_service,tech_support_yes,streaming_tv_no_internet_service,streaming_tv_yes,streaming_movies_no_internet_service,streaming_movies_yes,contract_type_one_year,contract_type_two_year,internet_service_type_fiber_optic,internet_service_type_none,payment_type_credit_card_(automatic),payment_type_electronic_check,payment_type_mailed_check
0,0002-ORFBO,Female,0,1,1,9,1,No,No,Yes,No,Yes,Yes,No,1,65.6,593.3,0,One year,DSL,Mailed check,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,0,0,0,0,1
1,0003-MKNFE,Male,0,0,0,9,1,Yes,No,No,No,No,No,Yes,0,59.9,542.4,0,Month-to-month,DSL,Mailed check,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1
2,0004-TLHLJ,Male,0,0,0,4,1,No,No,No,Yes,No,No,No,1,73.9,280.85,1,Month-to-month,Fiber optic,Electronic check,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0
3,0011-IGKFF,Male,1,1,0,13,1,No,No,Yes,Yes,No,Yes,Yes,1,98.0,1237.85,1,Month-to-month,Fiber optic,Electronic check,1,0,0,0,0,0,1,0,1,0,0,0,1,0,1,0,0,1,0,0,1,0
4,0013-EXCHZ,Female,1,1,0,3,1,No,No,No,No,Yes,Yes,No,1,83.9,267.4,1,Month-to-month,Fiber optic,Mailed check,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,1,0,0,0,1

Split your data

In [33]:
# Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.
# function down below and in prepare.py

In [34]:
# Run the function on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.
train_iris, validate_iris, test_iris = prepare.split_data(prepare.prep_iris())
print(len(train_iris), len(validate_iris), len(test_iris))

96 24 30

In [35]:
# Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.
train_titanic, validate_titanic, test_titanic = prepare.split_data(prepare.prep_titanic())
print(len(train_titanic), len(validate_titanic), len(test_titanic))

569 143 179

In [36]:
# Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.
train_telco, validate_telco, test_telco = prepare.split_data(prepare.prep_telco())
print(len(train_telco), len(validate_telco), len(test_telco))

4507 1127 1409

<div style="border: 5px solid black;"></div>

Functions for `acquire.py`

In [44]:
def get_connection(db, user=env.user, host=env.host, password=env.pwd):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

def get_titanic_data():
    filename = "data/titanic.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)

        # Return the dataframe to the calling code
        return df 
    
def get_iris_data():
    filename = "data/iris.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM species JOIN measurements USING (species_id)',
                                                                 get_connection('iris_db'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)

        # Return the dataframe to the calling code
        return df 
    
def get_telco_data():
    filename = "data/telco_churn.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('''SELECT * FROM customers
                            JOIN contract_types USING (contract_type_id)
                            JOIN internet_service_types USING (internet_service_type_id)
                            JOIN payment_types USING (payment_type_id)''',
                                                                 get_connection('telco_churn'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)

        # Return the dataframe to the calling code
        return df

<div style="border: 5px solid black;"></div>

Functions for `prepare.py`

In [39]:
def prep_iris(iris=acquire.get_iris_data()):
    '''
    accepts the raw iris data
    returns the data with the transformations above applied
    '''
    # Drop the species_id and measurement_id columns.
    cols_to_drop = ['species_id', 'measurement_id']
    iris = iris.drop(columns=cols_to_drop)

    # Rename the species_name column to just species.
    iris = iris.rename(columns={'species_name':'species'})
    
    # Create dummy variables of the species name and concatenate onto the iris dataframe. 
    dummy_df = pd.get_dummies(iris['species'], drop_first=True)
    iris = pd.concat([iris, dummy_df], axis=1)
    return iris

In [40]:
def prep_titanic(titanic=acquire.get_titanic_data()):
    '''
    accepts the raw titanic data
    returns the data with the transformations above applied
    '''
    # dropping embarked column
    cols_to_drop = ['embarked','pclass']
    titanic = titanic.drop(columns=cols_to_drop)
    
    # Encode the categorical columns.
    dummy_df = pd.get_dummies(titanic[['embark_town', 'class', 'sex']], dummy_na=False, drop_first=True)
    titanic = pd.concat([titanic, dummy_df], axis=1)
    
    # rename columns to be lowercased with underscores
    titanic.columns = [col.lower().replace(" ", "_") for col in titanic.columns]
    return titanic

In [41]:
def prep_telco(telco=acquire.get_telco_data()):
    '''
    accepts the raw telco data
    returns the data with the transformations above applied
    '''
    # Dropping foreign keys
    telco = telco.iloc[:,3:]
    
    # Encoding binary variables
    binary_cols = ['partner','dependents','phone_service', 'paperless_billing', 'churn']
    for col in binary_cols:
        telco[col] = telco[col].replace({'Yes': 1, 'No': 0})

    # Encoding multiclass variables
    dummy_df = pd.get_dummies(telco[['gender', 'multiple_lines', 'online_security', 'online_backup',
                                     'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies',
                                     'contract_type', 'internet_service_type', 'payment_type']],
                              dummy_na=False, drop_first=True)
    telco = pd.concat([telco, dummy_df], axis=1)
    
    # rename columns to be lowercased with underscores
    telco.columns = [col.lower().replace(" ", "_") for col in telco.columns]
    return telco

In [42]:
def split_data(df, test_size=.2, validate_size=.2, stratify_col=None, random_state=None):
    '''
    take in a DataFrame and return train, validate, and test DataFrames;.
    return train, validate, test DataFrames.
    '''
    # no stratification
    if stratify_col == None:
        # split test data
        train_validate, test = train_test_split(df, test_size=test_size, random_state=random_state)
        # split validate data
        train, validate = train_test_split(train_validate, test_size=validate_size, random_state=random_state)
    # stratify split
    else:
        # split test data
        train_validate, test = train_test_split(df, test_size=test_size, random_state=random_state,
                                                stratify = df[stratify_col])
        # split validate data
        train, validate = train_test_split(train_validate, test_size=validate_size,
                                           random_state=random_state,
                                           stratify=train_validate[stratify_col])       
    return train, validate, test